-- Дадена е базата от данни Movies, в която се съхранява информация за филми, 
-- филмови студии, които ги произвеждат, продуцентите на филмите, 
-- както и актьорите, които участват в тях.

-- Таблицата Movie съдържа информация за филми. 
-- Атрибутите title и year заедно формират първичния ключ.
--   title – заглавие;
--   year – година, в която е заснет филмът;
--   length – дължина в минути;
--   incolor – 'Y' за цветен филм и 'N' за чернобял;
--   studioname – име на студио, външен ключ към Studio.
--   name;
--   producerc# - номер на сертификатна продуцента, външен ключ към MovieExec.
--   cert#.

-- Таблицата Studio съдържа информация за филмови студиа:
--   name – име, първичен ключ;
--   address – адрес;
--   presc#-номер на сертификатна президента на студиото.

-- Таблицата MovieStar съдържа информация за филмови звезди:
--   name – име, първичен ключ;
--   address – адрес;
--   gender – пол, 'M' за мъж и 'F' за жена;
--   birthdate – рождена дата.

-- Таблицата StarsIn съдържа информация за участието на филмовите звезди във филмите. 
-- Трите атрибута заедно формират първичния ключ. 
-- Атрибутите movietitle и movieyear образуват външен ключ към Movie.
--   movietitle – заглавие на филма;
--   movieyear – година на заснемане на филма;
--   starname – име на филмовата звезда, външен ключ към MovieStar. 
--   name.

-- Таблицата MovieExec съдържа информация за продуцентите на филми.
--   cert# – номер на сертификат, първичен ключ;
--   name – име;
--   address – адрес;
--   networth – нетни активи;

-- Забележка за всички таблици: 
-- Всички атрибути, които не участват във формирането на първичен ключ, могат да приемат nullстойност.

--------------------------------------------------------------------
--------------------------------------------------------------------
--------------------------------------------------------------------

-- 1. Да се напише заявка, която да изведе име на студио, годината на първия филм за това студио, 
-- годината на последния филм за това студио и броя на всички филми за това студио, 
-- само за тези студиа започващи с буквата ‘M’.
SELECT s.name, MIN(m.year), MAX(m.year), COUNT(m.year)
FROM Studio s
JOIN Movie m ON m.studioname = s.name
WHERE s.name LIKE 'M%'
GROUP BY s.name;

-- 2.Да се напише заявка, която да изведе името на актрисата, участвала в най-много филми, 
-- и броя на филмите, в които е участвала.
SELECT starname, COUNT(movietitle)
FROM StarsIn
GROUP BY starname
HAVING COUNT(movietitle) = (
      SELECT MAX(cnt)
      FROM (
            SELECT starname, COUNT(movietitle) cnt
            FROM StarsIn
            GROUP BY starname
      )
)
