#include <iostream>
#include <algorithm>

/**
 * Във всяка от n панички са поставени съответно a1, a2, ..., an жълтици (ai > 0).
 *
 * Задачата Ви е да изберете няколко панички така, че като съберете всички жълтици от тях,
 * полученият брой жълтици да се дели на 3 и да е максимален.
 *
 * Предложете възможно най-ефикасен алгоритъм за тази цел.
 *
 * Упътване 1:
 * Разсъждавайте за паничките, които нямада бъдат включени в оптималното решение.
 * Съобразете, че техният брой е малък.
 * Започнете с въпроса: при какво условие можем да вземем жълтиците от всички панички?
 *
 * Упътване 2:
 * Друг възможна техника за решаване на задачата е динамично програмиране.
 */

unsigned maxSum(unsigned *arr, int n) {
    
}

int main() {
    unsigned *arr = new unsigned[10]{3, 5, 7, 10, 9, 6, 1, 3, 11, 17};

    std::cout << maxSum(arr, 10);

    return 0;
}