; Дадени са следните дефиниции на програмните езици Haskell и Scheme, отпрограмния код на които липсват части. 
; Попълнете полетата, обозначени с ______ снеобходимия програмен код така, че да се получат посочените желани оценки. 

(define (filterByElement x m)  
    (filter (lambda (l) (member? x l)) m))

; израз:​ (​filterByElement 2 '( (1 2 3) (2 3 4) (3 4 5) ) ​)
; желана оценка:​ (​ (1 2 3) (2 3 4) ​)

; Дадени са следните изрази, съответно на програмните езици Haskell и Scheme. Да се посочи каквае оценката на израза.
; израз:​ 
(​apply + ​(​map ​(​lambda (l) (apply max l))​ '​(​(5 -2) (1 9) (6 -8) ​)​)​)
; Оценка: '((5 -2) (1 9) (6 -8)) -> '(5 9 6) -> 20
