-- Дадена е базата от данни Movies, в която се съхранява информация за филми, 
-- филмови студии, които ги произвеждат, продуцентите на филмите, 
-- както и актьорите, които участват в тях.

-- Таблицата Movie съдържа информация за филми. 
-- Атрибутите title и year заедно формират първичния ключ.
--   title – заглавие;
--   year – година, в която е заснет филмът;
--   length – дължина в минути;
--   incolor – 'Y' за цветен филм и 'N' за чернобял;
--   studioname – име на студио, външен ключ към Studio.
--   name;
--   producerc# - номер на сертификатна продуцента, външен ключ към MovieExec.
--   cert#.

-- Таблицата Studio съдържа информация за филмови студиа:
--   name – име, първичен ключ;
--   address – адрес;
--   presc#-номер на сертификатна президента на студиото.

-- Таблицата MovieStar съдържа информация за филмови звезди:
--   name – име, първичен ключ;
--   address – адрес;
--   gender – пол, 'M' за мъж и 'F' за жена;
--   birthdate – рождена дата.

-- Таблицата StarsIn съдържа информация за участието на филмовите звезди във филмите. 
-- Трите атрибута заедно формират първичния ключ. 
-- Атрибутите movietitle и movieyear образуват външен ключ към Movie.
--   movietitle – заглавие на филма;
--   movieyear – година на заснемане на филма;
--   starname – име на филмовата звезда, външен ключ към MovieStar. 
--   name.

-- Таблицата MovieExec съдържа информация за продуцентите на филми.
--   cert# – номер на сертификат, първичен ключ;
--   name – име;
--   address – адрес;
--   networth – нетни активи;

-- Забележка за всички таблици: 
-- Всички атрибути, които не участват във формирането на първичен ключ, могат да приемат null стойност.

--------------------------------------------------------------------
--------------------------------------------------------------------
--------------------------------------------------------------------

-- а) Да се огради буквата на заявката, която извежда име на студио и броя на филмите му, за тези студия с по-малко от два филма. 
-- Студиата, които нямат нито един филм, НЕ трябва да присъстват в резултата.
SELECT S.NAME, COUNT(M.TITLE) as CNT
FROM STUDIO S 
JOIN MOVIE M ON S.NAME = M.STUDIONAME
GROUP BY S.NAME
HAVING COUNT(M.TITLE) < 2;

-- б) Да се напише заявка, която да изведе имената на всички продуценти с минимален нетен актив.
SELECT name
FROM MovieExec
WHERE networth = (SELECT MIN(networth) FROM MovieExec)