-- Дадена е базата от данни Movies, в която се съхранява информация за филми, 
-- филмови студии, които ги произвеждат, продуцентите на филмите, 
-- както и актьорите, които участват в тях.

-- Таблицата Movie съдържа информация за филми. 
-- Атрибутите title и year заедно формират първичния ключ.
--   title – заглавие;
--   year – година, в която е заснет филмът;
--   length – дължина в минути;
--   incolor – 'Y' за цветен филм и 'N' за чернобял;
--   studioname – име на студио, външен ключ към Studio.
--   name;
--   producerc# - номер на сертификатна продуцента, външен ключ към MovieExec.
--   cert#.

-- Таблицата Studio съдържа информация за филмови студиа:
--   name – име, първичен ключ;
--   address – адрес;
--   presc#-номер на сертификатна президента на студиото.

-- Таблицата MovieStar съдържа информация за филмови звезди:
--   name – име, първичен ключ;
--   address – адрес;
--   gender – пол, 'M' за мъж и 'F' за жена;
--   birthdate – рождена дата.

-- Таблицата StarsIn съдържа информация за участието на филмовите звезди във филмите. 
-- Трите атрибута заедно формират първичния ключ. 
-- Атрибутите movietitle и movieyear образуват външен ключ към Movie.
--   movietitle – заглавие на филма;
--   movieyear – година на заснемане на филма;
--   starname – име на филмовата звезда, външен ключ към MovieStar. 
--   name.

-- Таблицата MovieExec съдържа информация за продуцентите на филми.
--   cert# – номер на сертификат, първичен ключ;
--   name – име;
--   address – адрес;
--   networth – нетни активи;

-- Забележка за всички таблици: 
-- Всички атрибути, които не участват във формирането на първичен ключ, могат да приемат null стойност.

--------------------------------------------------------------------
--------------------------------------------------------------------
--------------------------------------------------------------------

-- Зад 1. Да се огради буквата на заявката, която извежда за всеки продуцент името му и броя на филмите му по години. 
-- Продуценти, които нямат нито един филм, НЕ трябва да присъстват в резултатното множество.
SELECT ME.NAME, M.YEAR, COUNT(*) AS CNT
FROM MOVIEEXEC ME
JOIN MOVIE M ON ME.CERT# = M.PRODUCERC#
GROUP BY ME.CERT#, ME.NAME, M.YEAR;

-- Зад 2.Да се напише заявка, която да изведе името на най-младата звезда (полът е без значение).
SELECT name
FROM MovieStar
WHERE birthdate = (SELECT MAX(birthdate) FROM MovieStar)