// A)​ Следните програмни фрагменти са съответно от булева функция на C++ и статичен булевметод на Java, 
// проверяващи дали в даден масив ​a​ от цели числа, подредени в нарастващ ред, сесъдържа числото ​x​. 
// Функцията/методът прилагат алгоритъма за двоично търсене. Липсващитечасти от фрагментите са обозначени с ______. 
// Попълнете липсващите части така, че функциятаили съответно методът да са коректно дефинирани спрямо това описание.  
// ​Решете задачатаза един от двата езика по избор!

bool member (int x, int a[], int size) {
    if (size == 0) return false;          
    return a[size/2] == x ||             
        (a[size/2] < x && member(x, a + (size/2), size/2)) ||
        (member(x, a, size/2)); 
}

// Б)​ (C++ и Java) Нека е дефиниран масив ​nums​, в който се съдържат ​N​ целочислени стойности.
// Попълнете празните полета, за да бъде коректна програмната реализация на алгоритъма за сортиране 
// във възходящ ред чрез пряка селекция (selection sort).
for (int i = 0; i < N i++) {  
    int min = i;  
    for (int j = i + 1; j < N; j++) {      
        if(nums[j] < nums[min]) min = j;   
    }   
    if(min != i) {      
        int x = nums[i];      
        nums[i] = nums[min];     
        nums[min] = x;   
    }
}

// В)​ Каква ще бъде стойността на променливата ​result​ след изпълнение на следния програменфрагмент на C++/Java:
int a = 0; 
int b = 15; 
int result = ­1;
if (b < 10 && b / a < 10) result = 0;
else  result = 1;
// б) 0 

// Г)​ Каква е стойността на израза 6 | 11​ на езиците C++ и Java:
// а) 15
