; Дадени са следните дефиниции на програмните езици Haskell и Scheme, отпрограмния код на които липсват части. 
; Попълнете полетата, обозначени с ______ снеобходимия програмен код така, че да се получат посочените желани оценки. 
; Изберете самоедин от двата езика за решението на задачата и напишете името му в даденото за целта поле.
; Точки за задачата се дават само за избрания от вас език.

(define (merge l1 l2)  
    (cond ((null? l1) l2)
        ((null? l2) l1)
        ((< (car l1) (car l2)) (cons (car l1) (merge (cdr l1) l2)))
        (else (cons (car l2) (merge l1 (cdr l2))))))

; израз:​ (merge '(1 3 5 7) '(2 2 6 10))
; желана оценка:​ (1 2 2 3 5 6 7 10)

;израз:​ 
((lambda (l) (filter (lambda (x) (even? x)) l)) '(1 2 3 4))
; желана оценка:​ (2,4)
